InformationRegisters/ЛБ_ТекущийШаблонПриказаМеталлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТекущийШаблонПриказаМеталлы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОклонениеОтБазовой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазоваяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазоваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Металл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ОтклонениеОтБазовойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ОтклонениеОтБазовойЦены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Относительное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Абсолютное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ЗаполнениеЦенМеталловИзПриказа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Приказ = Параметры.Документ.Ссылка;  
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Приказ) Тогда 
		Сообщить("Не выбран приказ!");
		Возврат;
	КонецЕсли;   
	
	Если Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.СохранитьИзменения.Доступность = ложь; 
		Элементы.ТаблицаМ.ТолькоПросмотр = Истина;  
		Элементы.ТаблицаН.ТолькоПросмотр = Истина;  
	КонецЕсли;	
	
	ТаблицаМеталлов.Загрузить(Приказ.ЦеныМеталлы.Выгрузить());
	ТаблицаНастроек.Загрузить(Приказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить());
	
	ПоГруппамПроб = Истина;
	
	КатегорииДоп = ТаблицаМеталлов.Выгрузить(, "КатегорияОбъектаЗалога");
	КатегорииДоп.Свернуть("КатегорияОбъектаЗалога");   
	
	КлючСтроки = 0; 
	Категории.Очистить();
	Для каждого СтрД Из КатегорииДоп Цикл 
		КлючСтроки = КлючСтроки + 1;
		НоваяСтрД = Категории.Добавить(); 
		НоваяСтрД.КлючСтроки = КлючСтроки; 
		НоваяСтрД.Категория = СтрД.КатегорияОбъектаЗалога;
	КонецЦикла;
	
	Для каждого СтрД Из Категории Цикл
	    ДобавитьКолонкуДоп(СтрД.КлючСтроки, СтрД.Категория);
	КонецЦикла;   
		
	ЗаполнитьТаблицыИзПриказа(); 
	УстановитьУсловноеОформление();
	
	МассивСК = Новый Массив;
	Для каждого СтрК Из Приказ.СхемыКредитования Цикл
		МассивСК.Добавить(СтрК.СхемаКредитования);
	Конеццикла;	
	Элементы.ТаблицаНСхемаКредитования.СписокВыбора.ЗагрузитьЗначения(МассивСК);
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформление() 
	УсловноеОформление.Элементы.Очистить();

	Для каждого Стр Из ТаблицаМеталлов Цикл 
		Если НЕ стр.БазоваяНастройка Тогда
			Продолжить;
		КонецЕсли;	
			
		ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина,));

		// Создаем условие отбора
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаМ.Проба"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		Если ПоГруппамПроб Тогда
			Проба = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(Стр.Проба);
		Иначе	
		    Проба = Стр.Проба;
		КонецЕсли;
		ЭлементОтбора.ПравоеЗначение = Проба;
        ЭлементОтбора.Использование = Истина;		
			
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить(); 
		Отбор = Новый Структура;
		Отбор.Вставить("Категория", Стр.КатегорияОбъектаЗалога);
		СтрокиК = Категории.НайтиСтроки(Отбор);
		Ключ = СтрокиК.Получить(0).КлючСтроки;
		ИмяПоляФормы = "Категория_" + СокрЛП(Ключ);
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляФормы); 		
		ПолеОформления.Использование = Истина; 	   
				
		ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);

		// Создаем условие отбора
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаМ.Проба"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		Если ПоГруппамПроб Тогда
			Проба = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(Стр.Проба);
		Иначе	
		    Проба = Стр.Проба;
		КонецЕсли;
		ЭлементОтбора.ПравоеЗначение = Проба;
        ЭлементОтбора.Использование = Истина;		
			
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить(); 
		Отбор = Новый Структура;
		Отбор.Вставить("Категория", Стр.КатегорияОбъектаЗалога);
		СтрокиК = Категории.НайтиСтроки(Отбор);
		Ключ = СтрокиК.Получить(0).КлючСтроки;
		ИмяПоляФормы = "Категория_" + СокрЛП(Ключ);
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляФормы); 		
		ПолеОформления.Использование = Истина; 	   
				
	   // Если ПоГруппамПроб Тогда
       //   Прервать;
       //КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыИзПриказа(БезНастроек = Ложь) 		
	ТаблицаМеталловДоп = ТаблицаМеталлов.Выгрузить();
	ТаблицаМеталловДоп.Свернуть("Металл, Проба");
	
	ТаблицаМ.Очистить();
	Для каждого Стр Из ТаблицаМеталловДоп Цикл  
		Если ПоГруппамПроб Тогда
			Проба = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(Стр.Проба);
		Иначе
			Проба = Стр.Проба;
		КонецЕсли;
		Отбор = Новый Структура;
		Отбор.Вставить("Проба", Проба);
		Строки = ТаблицаМ.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ТаблицаМ.Добавить();		 
		НоваяСтр.Металл = Стр.Металл; 
		НоваяСтр.Проба = Проба; 
							
		ОтборМ = Новый Структура;
		ОтборМ.Вставить("Металл", Стр.Металл);
		ОтборМ.Вставить("Проба", Стр.Проба);
		Для каждого СтрК Из Категории Цикл
			ОтборМ.Вставить("КатегорияОбъектаЗалога", СтрК.Категория);
			СтрокиМ = ТаблицаМеталлов.НайтиСтроки(ОтборМ);
			Если НЕ СтрокиМ.Количество() = 0 Тогда 
				СтрМ = СтрокиМ.Получить(0);
			    НоваяСтр["Категория_" + Строка(СтрК.КлючСтроки)] = СтрМ.Цена;
			КонецЕсли;	
        Конеццикла;
	Конеццикла;	  
	
	Если БезНастроек Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНастроекДоп = ТаблицаНастроек.Выгрузить();
	ТаблицаНастроекДоп.Свернуть("Металл, Проба, СхемаКредитования, ОтклонениеОтБазовойЦены");
	
	ТаблицаН.Очистить();
	Для каждого Стр Из ТаблицаНастроекДоп Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Проба", Стр.Проба);
		Строки = ТаблицаН.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	

		НоваяСтр = ТаблицаН.Добавить();		 
		НоваяСтр.Металл = Стр.Металл; 
		НоваяСтр.Проба = Проба;   
		НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
		НоваяСтр.Отклонение = Стр.ОтклонениеОтБазовойЦены;
				
		ОтборМ = Новый Структура;
		ОтборМ.Вставить("Металл", Стр.Металл);
		ОтборМ.Вставить("Проба", Стр.Проба); 
		ОтборМ.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		ОтборМ.Вставить("ОтклонениеОтБазовойЦены", Стр.ОтклонениеОтБазовойЦены);
		Для каждого СтрК Из Категории Цикл 
			ОтборМ.Вставить("КатегорияОбъектаЗалога", СтрК.Категория);
			СтрокиМ = ТаблицаНастроек.НайтиСтроки(ОтборМ);
			Если НЕ СтрокиМ.Количество() = 0 Тогда 
				СтрМ = СтрокиМ.Получить(0);
			    НоваяСтр["КатегорияН_" + Строка(СтрК.КлючСтроки)] = СтрМ.ЗначениеОтклонения;
			Иначе
				ОтборМ.Вставить("КатегорияОбъектаЗалога", Справочники.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка());
			    СтрокиМ = ТаблицаНастроек.НайтиСтроки(ОтборМ);
                Если НЕ СтрокиМ.Количество() = 0 Тогда 
					СтрМ = СтрокиМ.Получить(0);
				    НоваяСтр["КатегорияН_" + Строка(СтрК.КлючСтроки)] = СтрМ.ЗначениеОтклонения;
				КонецЕсли;	
			КонецЕсли;	
        Конеццикла;
	Конеццикла;	

КонецПроцедуры   

&НаСервере
Процедура ДобавитьКолонкуДоп(КлючСтроки, Категория)
	МассивДобавляемыхРеквизитов = Новый Массив; 
	СписокТипов = Новый Массив;
    СписокТипов.Добавить(Тип("Число"));
    ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов,,,Новый КвалификаторыЧисла(10,3));
	НовыйРеквизит = Новый РеквизитФормы("Категория_" + СокрЛП(КлючСтроки), ОписаниеСоставногоТипа, "ТаблицаМ");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);  
	НовыйРеквизит = Новый РеквизитФормы("КатегорияН_" + СокрЛП(КлючСтроки), ОписаниеСоставногоТипа, "ТаблицаН");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	 
	ПолеВвода = Элементы.Добавить(
		"Категория_" + СокрЛП(КлючСтроки),    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		Элементы.ТаблицаМ); //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = СокрЛП(Категория);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;   
	
		
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ТаблицаМ.Категория_" + СокрЛП(КлючСтроки); 
	ПолеВвода.ВыбиратьТип = Ложь;
	ПолеВвода.КнопкаСоздания = Ложь;
	ПолеВвода.КнопкаОткрытия = Ложь;  
	
	ПолеВвода = Элементы.Добавить(
		"КатегорияН_" + СокрЛП(КлючСтроки),    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		Элементы.ТаблицаН); //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = СокрЛП(Категория);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ТаблицаН.КатегорияН_" + СокрЛП(КлючСтроки); 
	ПолеВвода.ВыбиратьТип = Ложь;
	ПолеВвода.КнопкаСоздания = Ложь;
	ПолеВвода.КнопкаОткрытия = Ложь;

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьПриказ();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура СохранитьПриказ()
	СохранитьИзмененияМеталловСФормы(ПоГруппамПроб);
	ДокументОбъект = Приказ.ПолучитьОбъект();
	ДокументОбъект.ЦеныМеталлы.Загрузить(ТаблицаМеталлов.Выгрузить());
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Загрузить(ТаблицаНастроек.Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияМеталловСФормы(ПоГруппам) 
	Если ПоГруппам Тогда 
		Для каждого Стр Из ТаблицаМ Цикл 
			Для каждого СтрП Из Стр.Проба.Пробы Цикл 
				Отбор = Новый Структура;
				Отбор.Вставить("Металл", Стр.Металл);
				Отбор.Вставить("Проба", СтрП.Проба);
						
				СтрокиС = ТаблицаМеталлов.НайтиСтроки(Отбор);
				Для каждого СтрС Из СтрокиС Цикл 
					ОтборД = Новый Структура;  
					ОтборД.Вставить("Категория", СтрС.КатегорияОбъектаЗалога);
					СтрокиД = Категории.НайтиСтроки(ОтборД); 
					Если НЕ СтрокиД.Количество() = 0 Тогда
						КлючСтроки = СтрокиД.Получить(0).КлючСтроки;
						СтрС.Цена = Стр["Категория_" + Строка(КлючСтроки)];
					КонецЕсли;	
				Конеццикла;	
			КонецЦикла;	
		КонецЦикла;	  
	Иначе	
		Для каждого Стр Из ТаблицаМ Цикл  
			Отбор = Новый Структура;
			Отбор.Вставить("Металл", Стр.Металл);
			Отбор.Вставить("Проба", Стр.Проба);
					
			СтрокиС = ТаблицаМеталлов.НайтиСтроки(Отбор);
			Для каждого СтрС Из СтрокиС Цикл 
				ОтборД = Новый Структура;  
				ОтборД.Вставить("Категория", СтрС.КатегорияОбъектаЗалога);
				СтрокиД = Категории.НайтиСтроки(ОтборД); 
				Если НЕ СтрокиД.Количество() = 0 Тогда
					КлючСтроки = СтрокиД.Получить(0).КлючСтроки;
					СтрС.Цена = Стр["Категория_" + Строка(КлючСтроки)];
				КонецЕсли;	
			Конеццикла;	
		Конеццикла;	  
	КонецЕсли;   
	
	ТаблицаНастроек.Очистить();
	Для каждого Стр Из ТаблицаН Цикл   
		Для каждого СтрК Из Категории Цикл 
			КлючСтроки = СтрК.КлючСтроки;
			ЗначениеОтклонения = Стр["КатегорияН_" + Строка(КлючСтроки)]; 
			Если ЗначениеОтклонения = 0 Тогда
				Продолжить;
	        КонецЕсли;
			НоваяСтрН = ТаблицаНастроек.Добавить();
			НоваяСтрН.Металл = Стр.Металл;
			НоваяСтрН.Проба = Стр.Проба;
			НоваяСтрН.СхемаКредитования = Стр.СхемаКредитования;
			НоваяСтрН.ОтклонениеОтБазовойЦены = Стр.Отклонение;
			НоваяСтрН.КатегорияОбъектаЗалога = СтрК.Категория;
			НоваяСтрН.ЗначениеОтклонения = ЗначениеОтклонения;
		Конеццикла;	
	Конеццикла;	

КонецПроцедуры	


&НаКлиенте
Процедура ТаблицаМПриАктивизацииСтроки(Элемент)
	//СтрокаТабличнойЧасти = Элементы.ТаблицаМ.ТекущиеДанные;	
	//
	//Если СтрокаТабличнойЧасти <> неопределено Тогда
	//	
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Проба",СтрокаТабличнойЧасти.Проба);
	//	Элементы.ТаблицаН.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
	//Иначе
	//	
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Проба", ПредопределенноеЗначение("Справочник.ЛБ_Пробы.ПустаяСсылка"));
	//	Элементы.ТаблицаН.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	//			
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаНОтклонениеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если  НоваяСтрока И Не Копирование Тогда
	    ТекстрокаМ = Элементы.ТаблицаМ.ТекущиеДанные;  
		ТекстрокаН = Элементы.ТаблицаН.ТекущиеДанные; 
		ТекстрокаН.Металл = ТекстрокаМ.Металл;
		ТекстрокаН.Проба = ТекстрокаМ.Проба;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПоГруппамПробПриИзменении(Элемент)  
	ПоГруппам = ?(ПоГруппамПроб, ложь, истина); 
	Элементы.ТаблицаМПроба.Заголовок = ?(ПоГруппамПроб, "Группа проб", "Проба");
	СохранитьИзмененияМеталловСФормы(ПоГруппам);
	ТаблицаМ.Очистить();
	//ТаблицаН.Очистить(); 
	ЗаполнитьТаблицыИзПриказа(Истина);
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСценарию()
	Если НЕ УсловноеОформление.Элементы.Количество() = 0 Тогда 
		СохранитьИзмененияМеталловСФормы(ПоГруппамПроб);
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", Приказ.ШаблонМеталлы);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.Металл КАК Металл,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.Проба КАК Проба,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.Категория КАК Категория,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.БазоваяНастройка КАК БазоваяНастройка,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.БазоваяЦена КАК БазоваяЦена,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.ОклонениеОтБазовой КАК ОклонениеОтБазовой,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.ПорядокОкругления КАК ПорядокОкругления,
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону
		               |ИЗ
		               |	РегистрСведений.ЛБ_ТекущийШаблонПриказаМеталлы КАК ЛБ_ТекущийШаблонПриказаМеталлы
		               |ГДЕ
		               |	ЛБ_ТекущийШаблонПриказаМеталлы.Регистратор = &Регистратор";
		ШаблонМеталлов = Запрос.Выполнить().Выгрузить(); 
		ТаблицаДоп = ШаблонМеталлов.Скопировать(); 
		ТаблицаДоп.Свернуть("Металл");
		
		Для каждого СтрМ Из ТаблицаДоп Цикл 
			ЦенаБазовая = 0;
			Отбор = новый Структура;
			Отбор.Вставить("БазоваяНастройка", Истина);
			Отбор.Вставить("Металл", СтрМ.Металл);
			Строки = ТаблицаМеталлов.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда
				ЦенаБазовая = Строки.Получить(0).Цена;
			КонецЕсли;

			Для каждого Стр Из ШаблонМеталлов Цикл
				Если НЕ Стр.Металл = СтрМ.Металл Тогда
					Продолжить;
				КонецЕсли;	
				Отбор = Новый Структура;
				Отбор.Вставить("Металл", Стр.Металл);
				Отбор.Вставить("Проба", Стр.Проба);
				Отбор.Вставить("КатегорияОбъектаЗалога", Стр.Категория);
				СтрокиМ = ТаблицаМеталлов.НайтиСтроки(Отбор); 
				Если НЕ СтрокиМ.Количество() = 0 Тогда
					СтрМ = СтрокиМ.Получить(0);
				  	Если Стр.БазоваяНастройка Тогда 
						 СтрМ.Цена = ЦенаБазовая;
					 Иначе
						 Если Стр.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда  
							 СтрМ.Цена = ЦенаБазовая + стр.ЗначениеОтклонения;
						 ИначеЕсли Стр.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
							 СтрМ.Цена = ЦенаБазовая + ЦенаБазовая*стр.ЗначениеОтклонения/100;
						 КонецЕсли;	  
						 Если ЗначениеЗаполнено(Стр.ПорядокОкругления) Тогда     
							 СтрМ.Цена = ЛБ_ОбщийМодуль.ОкруглитьЦену(СтрМ.Цена, Стр.ПорядокОкругления, Стр.ОкруглятьВБольшуюСторону);
						 КонецЕсли;	 
					 КонецЕсли;	 
				КонецЕсли;	 
			КонецЦикла; 
		КонецЦикла;	
        ТаблицаМ.Очистить();
		ЗаполнитьТаблицыИзПриказа(Истина);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаМПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования) 
	ЗаполнитьПоСценарию();
КонецПроцедуры

&НаСервере
Функция ПроверитьОтказРедактирования(Проба, КатегорияИмя) 
	Если НЕ УсловноеОформление.Элементы.Количество() = 0 Тогда
		ЕстьПроба = Ложь; 
		ЕстьКатегория = Ложь;
		Для сч = 0 По УсловноеОформление.Элементы.Количество() - 1 Цикл 
			Если УсловноеОформление.Элементы.Получить(сч).Отбор.Элементы.Получить(0).ПравоеЗначение = Проба Тогда
				ЕстьПроба = Истина; 
			КонецЕсли;
			Если СокрЛП(УсловноеОформление.Элементы.Получить(сч).Поля.Элементы.Получить(0).Поле) = КатегорияИмя Тогда 
				ЕстьКатегория = Истина;
			КонецЕсли;
			Если ЕстьПроба И ЕстьКатегория Тогда 
				Прервать;
			КонецЕсли;	
		Конеццикла;	
		Если НЕ ЕстьПроба ИЛИ НЕ ЕстьКатегория Тогда
			Возврат Истина;
		КонецЕсли;	  
	КонецЕсли;	
    Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ТаблицаМПередНачаломИзменения(Элемент, Отказ)	
	ТекСтрока = Элементы.ТаблицаМ.ТекущиеДанные; 
    ТекЭлемент = Элементы.ТаблицаМ.ТекущийЭлемент;
	
	Если ПроверитьОтказРедактирования(ТекСтрока.Проба, ТекЭлемент.Имя) Тогда
		Отказ = Истина;
	КонецЕсли;	                                                                    
КонецПроцедуры
